#+title: =qr-analysis= Lab-book
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+infojs_opt:
#+property: session *R*
#+property: cache yes
#+property: results graphics
#+property: exports both
#+property: tangle yes
#+seq_todo: TODO(t!) STARTED(s!) WAITING(w!) | DONE(d!) CANCELLED(c!) DEFERRED(f!)

Lab-book intended to document my efforts into extending Marcelo's
assignment/paper about QR Factorization analysis.

*** Launching the experiments

Hello! I suppose you've read the info in the previous section, so, here's the
deal: I use a script to run experiments.

Here's the maximum value of the elements in the matrices we'll deal with:

#+name: values_range
#+begin_src bash :results output :exports results
echo 100
#+end_src

#+RESULTS: values_range
: 100

It's big, I know, but it ensures that they run in the right nodes and it
installs all needed dependencies! Take a look at it:

#+begin_src bash :shebang "#!/bin/bash" :results none :tangle experiments/launch.sh
# more robust script
set -euo pipefail

function usage {
cat << EOF
  $0 [OPTIONS] <EXP_ID> [REPO_DIRECTORY]

  WHERE <EXP_ID> is the identificator of the experiment

  WHERE [OPTIONS] can be any of the following, in no particular order:
    -h | --help
      shows this message and exits
    -d | --dry
      prints what it would do instead of actually doing it
    -a | --available
      only use currently available nodes
    -u | --update
      updates the repo before running any commands
    -i | --install[=]path/to/the/installs
      use another dir instead of the default $HOME/Installs/spack
    --spack[=]path/to/spack
      use another spack dir instead of the default $HOME/spack-erad
    -p | --partitions[=]list,of,partitions,comma,separated
      define the desired partitions to be used (default: cei)
    -s | --split
      split the execution plan between all nodes that ought to be used
      WARNING: the splitting will occur between same-partition nodes only
               i.e.: if more than one partition is listed, we'll repeat
               the process in the other partitions
    -n | --nodes[=]list,of,nodes,comma,separated
      define the desired nodes to be used
      WARNING: this option disables usage of the partition list!
    -l | --local
      install all packages locally in each machine
      WARNING: probably won't work because of timeouts in spack
    -o | --overwrite
      overwrite the install of all packages listed as a dependency
    -O | --strong-overwrite
      force the reinstall of all packages listed as a dependency

  WHERE [REPO_DIRECTORY] is the *full* path to the repository
    It is presumed that you are in it, if you don't provide this argument
EOF
}

for i in "$@"; do
    case $i in
        -h|--help)
            echo "USAGE:"
            usage
            exit 0
            ;;
        --dry)
            DRY=echo
            shift
            ;;
        --update)
            git pull
            shift
            ;;
        --install=*)
            INSTALL_DIR=${i#*=}
            shift
            ;;
        --install)
            shift
            INSTALL_DIR=$1
            shift
            ;;
        --spack=*)
            SPACK_DIR=${i#*=}
            shift
            ;;
        --spack)
            shift
            SPACK_DIR=$1
            shift
            ;;
        --overwrite)
            OVERWRITE=true
            shift
            ;;
        --strong-overwrite)
            OVERWRITE=strong
            shift
            ;;
        --available)
            AVAILABLE="-t idle"
            shift
            ;;
        --split)
            SPLIT=true
            shift
            ;;
        --partitions=*)
            PARTITIONLIST=$(tr ',' ' ' <<<${i#*=})
            shift
            ;;
        --partitions)
            shift
            PARTITIONLIST=$(tr ',' ' ' <<<$1)
            shift
            ;;
        --nodes=*)
            NODELIST=$(tr ',' '\n' <<<${i#*=})
            PARTITIONLIST=$(sed -E 's/([0-9]+)//g' <<<$NODELIST | uniq | xargs)
            shift
            ;;
        --nodes)
            shift
            NODELIST=$(tr ',' '\n' <<<$1)
            PARTITIONLIST=$(sed -E 's/([0-9]+)//g' <<<$NODELIST | uniq | xargs)
            shift
            ;;
        --local)
            INSTALL_DIR=/scratch/$USER/.installs
            SPACK_DIR=/scratch/$USER/.spack
            LOCAL=true
            shift
            ;;
        --*)
            echo "ERROR: Unknown long option '$i'"
            echo
            echo "USAGE:"
            usage
            exit 1
            ;;
        -*)
            options=$(sed 's/./& /g' <<<${i#-})
            for letter in $options; do
                case $letter in
                    d)
                        DRY=echo
                        ;;
                    u)
                        git pull
                        ;;
                    i)
                        shift
                        INSTALL_DIR=$1
                        ;;
                    o)
                        OVERWRITE=true
                        ;;
                    O)
                        OVERWRITE=strong
                        ;;
                    a)
                        AVAILABLE="-t idle"
                        ;;
                    s)
                        SPLIT=true
                        ;;
                    p)
                        shift
                        PARTITIONLIST=$(tr ',' ' ' <<<$1)
                        ;;
                    n)
                        shift
                        NODELIST=$(tr ',' '\n' <<<$1)
                        PARTITIONLIST=$(sed -E 's/([0-9]+)//g' <<<$NODELIST | uniq | xargs)
                        ;;
                    l)
                        INSTALL_DIR=/scratch/$USER/.installs
                        SPACK_DIR=/scratch/$USER/.spack
                        LOCAL=true
                        ;;
                    ,*)
                        echo "ERROR: Unknown short option '-${letter}'"
                        echo
                        echo "USAGE:"
                        usage
                        exit 1
                        ;;
                esac
            done
            shift
            ;;
    esac
done

# directory with needed dependencies installed
INSTALL_DIR=${INSTALL_DIR:-$HOME/Installs/spack}

# the experiment id
EXPERIMENT_ID=$1

# the work (repo) dir
REPO_DIR=${2:-$PWD}

# default run partition
PARTITIONLIST=${PARTITIONLIST:-cei}

# local install boolean
LOCAL=${LOCAL:-false}

# the split plan boolean
SPLIT=${SPLIT:-false}

# overwrite the packages?
OVERWRITE=${OVERWRITE:-false}

# the path to the spack installation
SPACK_DIR=${SPACK_DIR:-$HOME/spack-erad}

if [[ $REPO_DIR != /* ]]; then
    echo "ERROR: Path to repository is not absolute, please use the absolute path..."
    exit 2
fi

if [[ $INSTALL_DIR != /* ]]; then
    echo "ERROR: Path to installation dir is not absolute, please use the absolute path..."
    exit 2
fi

if [[ $SPACK_DIR != /* ]]; then
    echo "ERROR: Path to spack isn't absolute, please use the absolute path..."
    exit 2
fi

EXP_DIR=$(find $REPO_DIR -type d -path "*/experiments/$EXPERIMENT_ID")
if [ ! -n "$EXP_DIR" ]; then
    echo "ERROR: There isn't any experiment with this ID..."
    exit 3
fi

pushd $REPO_DIR

for partition in $PARTITIONLIST; do
    # lets install all needed dependencies first
    if [ $LOCAL = false ]; then
        echo "-> Launching dependency installing job for partition $partition!"

        INSTALL_DIR+=/$partition # as we are not running locally
        ${DRY:-} sbatch \
            -p ${partition} \
            -N 1 \
            -J dependencies_${EXPERIMENT_ID}_${partition} \
            -W \
            $(dirname $EXP_DIR)/deps.sh $INSTALL_DIR $EXP_DIR $SPACK_DIR $OVERWRITE
        echo "... and done!"
    fi
    echo

    # change the gppd-info to sinfo when porting
    ALLNODES=$(gppd-info --long --Node -S NODELIST -p $partition -h ${AVAILABLE:-} | awk '{print $1}')
    if [ -z ${NODELIST+x} ]; then
        nodes=$(paste -s -d" " - <<<$ALLNODES)
    else
        nodes=$(grep "$NODELIST" <<<$ALLNODES | paste -s -d" " -)
    fi

    # splits the plan if we were told to
    if [ $SPLIT = true ]; then
        num_nodes=$(wc -w <<<$nodes)
        ${DRY:-} rm -f $EXP_DIR/runs.plan.${partition}.*
        ${DRY:-} split -n l/$num_nodes -d -a 1 $EXP_DIR/runs.plan $EXP_DIR/runs.plan.${partition}.
    fi

    # counter to access the correct plan
    plan_part=${num_nodes:+0}

    echo "-> Launching jobs for partition $partition!"

    for node in $nodes; do
        # if we are in local mode, install dependencies for this node
        if [ $LOCAL = true ]; then
            echo "Launching installation job locally for node ${node}..."
            ${DRY:-} sbatch \
                -p ${partition} \
                -w ${node} \
                -J dependencies_${EXPERIMENT_ID}_${node} \
                $(dirname $EXP_DIR)/deps.sh $INSTALL_DIR $EXP_DIR $SPACK_DIR $OVERWRITE
        fi

        # launch the slurm script for this node
        echo "Launching job for node ${node}..."
        ${DRY:-} sbatch \
            -p ${partition} \
            -w ${node} \
            -J qr_analysis_${EXPERIMENT_ID} \
            $EXP_DIR/exp.slurm $EXPERIMENT_ID $EXP_DIR $INSTALL_DIR ${plan_part:-}

        if [ ! -z ${plan_part:+z} ]; then
            plan_part=$((plan_part+1))
        fi
        echo
    done

    # if not local, revert the path so we can repeat to the next partition
    [ $LOCAL = false ] && INSTALL_DIR=$(dirname $INSTALL_DIR)

    echo
done

popd
#+end_src

*** Design

The random seed will be:

#+begin_src R :session :results value :exports results
floor(runif(1,1,99999))
#+end_src

#+RESULTS:
: 86229

Finally, the design itself:

#+begin_src R :session :results output :var expKey="exp01"
suppressMessages(library(tidyverse))
suppressMessages(library(DoE.base))

matrix = c(1024, 2048, 4096, 8192, 16384, 32768)
nb = c(32, 64, 128, 256, 512)
method = c("starpu", "libomp", "libgomp", "libkomp_gcc", "libkomp_clang", "kstar_starpu")

complete <- fac.design(
  nfactors=3,
  replications=5,
  repeat.only=FALSE,
  blocks=1,
  randomize=TRUE,
  seed=86229,
  factor.names=list(
    matrix_size=matrix,
    block_size=nb,
    runtime=method)) %>%
  as_tibble %>%
  filter(matrix_size == 8192) %>%
  transmute(id=as.numeric(Blocks), runtime, matrix_size, block_size) %>%
  write_delim(paste0("experiments/", expKey, "/runs.plan"), delim=" ", col_names=FALSE)

# the space delimited file is to help with the posterior parsing in the shell
# script
#+end_src

#+RESULTS:
:
: creating full factorial with 180 runs ...

*** Analysis

So, for the analysis of this data, I intend to create a function to amass all
collected data.

#+begin_src bash :exports both :results output :dir experiments/exp01/data :var INPUT="cei draco hype"
partitions=($INPUT)

for part in ${partitions[@]}; do
    echo $part

    mkdir $part
    for file in *${part}*.tar.gz; do
        echo $file
        tar xzf $file -C $part
    done
done
#+end_src

#+RESULTS:
#+begin_example
cei
exp01_cei2_48_data.tar.gz
exp01_cei3_48_data.tar.gz
exp01_cei4_48_data.tar.gz
exp01_cei5_48_data.tar.gz
exp01_cei6_48_data.tar.gz
exp01_cei7_48_data.tar.gz
exp01_cei8_48_data.tar.gz
draco
exp01_draco1_32_data.tar.gz
exp01_draco2_32_data.tar.gz
exp01_draco3_32_data.tar.gz
exp01_draco4_32_data.tar.gz
exp01_draco5_32_data.tar.gz
hype
exp01_hype3_40_data.tar.gz
exp01_hype4_40_data.tar.gz
exp01_hype5_40_data.tar.gz
#+end_example

And then lets get all that csv data!

#+begin_src R :session :results output :exports both
options(crayon.enabled = FALSE)
library(functional)
library(tidyverse)

collect_exp <- function(filename, exp_name) {
  read_csv(filename) %>%
    mutate(expid = exp_name)
}

data_dir <- "experiments/exp01/data/"
partitions <- c("cei", "hype", "draco")

partitions %>%
  lapply(Curry(paste0, data_dir)) %>%
  paste0("/results") %>%
  list.files(pattern = glob2rx("*.csv"), full.names = TRUE) %>%
  lapply(Curry(collect_exp, exp_name = "exp01")) -> dfs
#+end_src

#+RESULTS:
#+begin_example

Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
Parsed with column specification:
cols(
  node = col_character(),
  rep_id = col_double(),
  matrix_size = col_double(),
  block_size = col_double(),
  runtime = col_character(),
  compute_time = col_double(),
  total_time = col_double()
)
#+end_example

With all that data collected, lets put all of it in the same dataframe!

#+begin_src R :session :results output :exports both
dfs %>%
  reduce(bind_rows) %>%
  mutate(platform = str_remove(node, "[0-9]")) -> exp01_df

exp01_df
#+end_src

#+RESULTS:
#+begin_example

# A tibble: 450 x 9
   node  rep_id matrix_size block_size runtime compute_time total_time expid
   <
 <
      <
     <
<
         <
     <
<chr>
 1 cei2       1        8192        512 libomp         107.       108.  exp01
 2 cei2       1        8192         32 libkom…         NA         NA   exp01
 3 cei2       1        8192        256 libkom…         92.7       94.1 exp01
 4 cei2       1        8192        512 starpu         107.       109.  exp01
 5 cei2       1        8192        512 libkom…        107.       108.  exp01
 6 cei2       1        8192         64 libkom…        306.       307.  exp01
 7 cei2       1        8192         64 starpu         229.       231.  exp01
 8 cei2       1        8192        256 libgomp         86.7       88.2 exp01
 9 cei2       1        8192         32 libomp         761.       763.  exp01
10 cei2       1        8192         64 libgomp        240.       241.  exp01
# … with 440 more rows, and 1 more variable: platform <chr>
#+end_example

Now for some visualizations, I'll replicate the first figure from Marcelo's
paper.

#+begin_src R :session :results output :exports both
calculate_tasks <- function(x) {
  if(x == 1) return (1) else return (x*x + calculate_tasks(x-1))
}

exp01_df %>%
  group_by(platform, matrix_size, block_size, runtime) %>%
  summarize(avg_time = mean(compute_time),
            repetitions = n(),
            error = 3 * sd(compute_time) / sqrt(repetitions)) %>%
    rowwise() %>%
    mutate(num_tasks = calculate_tasks(matrix_size / block_size)) %>%
    ungroup() -> fig_1

fig_1
#+end_src

#+RESULTS:
#+begin_example

# A tibble: 90 x 8
   platform matrix_size block_size runtime  avg_time repetitions error num_tasks
   <chr>          <dbl>      <dbl> <chr>       <dbl>       <int> <dbl>     <dbl>
 1 cei             8192         32 kstar_s…     82.9           5  1.38   5625216
 2 cei             8192         32 libgomp     763.            5 40.3    5625216
 3 cei             8192         32 libkomp…     NA             5 NA      5625216
 4 cei             8192         32 libkomp…     NA             5 NA      5625216
 5 cei             8192         32 libomp      706.            5 52.9    5625216
 6 cei             8192         32 starpu      751.            5 63.9    5625216
 7 cei             8192         64 kstar_s…     10.5           5  1.30    707264
 8 cei             8192         64 libgomp     241.            5  7.58    707264
 9 cei             8192         64 libkomp…    308.            5  8.02    707264
10 cei             8192         64 libkomp…    306.            5  6.39    707264
# … with 80 more rows
#+end_example

now for the plot...

#+begin_src R :session :results output :file (org-babel-temp-file "figure" ".png") :exports both :width 500 :height 300
fig_1 %>%
  ggplot(aes(x = as.factor(matrix_size),
             y = avg_time,
             color = as.factor(runtime))) +
  geom_point(size = 2,
             position=position_dodge(width = 1)) +
  geom_errorbar(aes(ymin = avg_time - error,
                    ymax = avg_time + error),
                width = 0.6,
                position=position_dodge(width = 1)) +
  labs(x = "Tamanho da matriz",
       y = "Tempo médio de execução [seg]",
       color = "Runtime utilizado") +
  ylim(0, NA) +
  scale_y_continuous(expand = expand_scale(mult = c(0, 0.05)),
                     breaks = scales::pretty_breaks(n = 8)) +
  facet_grid(platform ~ block_size) +
  theme_bw() +
  theme(text = element_text(family = "Palatino", size = 16),
        legend.position = "top",
        axis.text.x = element_text(angle = 45, hjust = 1))
#+end_src

#+RESULTS:
:
: Scale for 'y' is already present. Adding another scale for 'y', which will
: replace the existing scale.
: Warning messages:
: 1: Removed 13 rows containing missing values (geom_point).
: 2: Removed 13 rows containing missing values (geom_errorbar).

there is inter-node variability...

#+begin_src R :session :results output graphics :file img/makespan-all.png :exports both :width 800 :height 600
suppressMessages(library(gtools))

fig_1 %>%
  mutate(case = factor(paste(platform, block_size, sep = " : "))) %>%
  mutate(case = factor(case, levels = mixedsort(levels(case)))) %>%
  ggplot(aes(x = as.factor(matrix_size),
             y = avg_time,
             color = as.factor(runtime),
             shape = as.factor(runtime))) +
  geom_point(size = 2,
             position=position_dodge(width = 1)) +
  geom_errorbar(aes(ymin = avg_time - error,
                    ymax = avg_time + error),
                width = 0.5,
                position=position_dodge(width = 1)) +
  labs(x = "Tamanho da matriz",
       y = "Tempo médio de execução [seg]",
       color = "Runtime utilizado",
       shape = "Runtime utilizado") +
  facet_wrap(~ case, scales="free", nrow = 3) +
  scale_y_continuous(expand = expand_scale(mult = c(0, 0.05)),
                     breaks = scales::pretty_breaks(n = 8),
                     limits = c(0, NA)) +
  theme_bw() +
  theme(text = element_text(family = "Palatino", size = 16),
        strip.text = element_text(size = 12),
        # strip.background = element_rect(fill = "white"),
        legend.position = "top")
#+end_src

#+RESULTS:

*** Design

Again we are going with an exhaustive design until second notice.

The random seed will be:

#+begin_src R :session :results value :exports results
floor(runif(1,1,99999))
#+end_src

#+RESULTS:
: 15195

And the design:

#+begin_src R :session :results none
suppressMessages(library(tidyverse))
suppressMessages(library(DoE.base))

matrix = c(1024, 2048, 4096, 8192, 16384, 32768)
nb = c(32, 64, 128, 256, 512)
method = c("starpu", "ompt", "scorep", "libkomp_gcc", "libkomp_clang", "kstar_starpu")

fac.design(
  nfactors=3,
  replications=1,
  repeat.only=FALSE,
  blocks=1,
  randomize=TRUE,
  seed=15195,
  factor.names=list(
    matrix_size=matrix,
    block_size=nb,
    runtime=method)) %>%
  as_tibble %>%
  filter(matrix_size == 8192) %>%
  transmute(runtime, matrix_size, block_size) %>%
  write_delim("experiments/exp02/runs.plan", delim=" ", col_names=FALSE)

# the space delimited file is to help with the posterior parsing in the shell
# script
#+end_src

*** Post-processing

Now we gotta do some post-processing in order to manipulate all collected data.

#+begin_src bash :exports both :results output
set -euo pipefail

DATA_DIR=experiments/exp02/data

for tar_file in $DATA_DIR/*.tar.gz; do
    echo "Extracting ${tar_file}..."
    mkdir ${tar_file%.tar.gz}
    tar xzf $tar_file -C ${tar_file%.tar.gz}
done

echo "Done extracting the files!"
#+end_src

#+RESULTS:
: Extracting experiments/exp04/data/exp04_cei1_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei2_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei3_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei4_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei5_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei6_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei7_48_data.tar.gz...
: Extracting experiments/exp04/data/exp04_cei8_48_data.tar.gz...
: Done extracting the files!

With all files extracted, lets collect the traces and transform them into
CSVs...

****** Generating ORG blocks                                       :noexport:
#+name: starpukstarnames
#+begin_src R :results output :session Rvz :exports none :eval no-export
blockQrStarpuKstar %>% names
#+end_src

#+RESULTS: starpukstarnames
: [1] "kstar-starpu" "starpu"

#+header: :var lista=starpukstarnames
#+begin_src shell :results value raw :exports results :eval no-export
echo " "
echo "****** Full View Chart"
for r in $lista; do
    echo "******* Execution $r"
    echo "#+header: :var dep1=customConfig"
    r2=$(echo $r | sed "s/\"//g")
    echo "#+begin_src R :results output graphics :file img/trace-qr-$r2-starvz.png :exports both :width 1400 :height 800 :session Rvz :eval no-export "
    echo "  the_master_function(blockQrStarpuKstar[[$r]])"
    echo "#+end_src"
    echo ""
done;
 #+end_src

***** Reading Data
#+header: :var rawDirExp="./experiments/exp02/results-draco1-wip"
#+header: :var fdep=rLibkomp
#+begin_src R :results output :exports both :session R :eval no-export

blockQrLibkomp <-
    grep("libkomp", list.dirs(path=rawDirExp, full.names=TRUE, recursive=FALSE), value=TRUE) %>%
    lapply(function(fl){
        print(paste0("Working on ", fl))
        readtrace(paste(fl, "tasks.csv", sep="/"))
    })

names(blockQrLibkomp) <-
    grep("libkomp", list.dirs(path=rawDirExp, full.names=TRUE, recursive=FALSE), value=TRUE) %>%
    lapply(function(fl){
        #nm <- basename(fl) %>% strsplit("_") %>% unlist()
        #nm[0:(length(nm)-2)] %>% paste(collapse ='-')
        nm <- basename(fl) %>% str_replace_all("_", "-") 
    })

#+end_src

  #+RESULTS:
  : [1] "Working on ./experiments/exp02/results-draco1-wip/libkomp_clang_8192_256"
  : [1] "Working on ./experiments/exp02/results-draco1-wip/libkomp_gcc_8192_256"


We should recompile this with -g option to include at least filenames
and row numbers...

